jmeter/results/html/statistics.json
{
  "GET Health" : {
    "transaction" : "GET Health",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.685000000000001,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 21.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 10.990000000000009,
    "throughput" : 8.4774499830451,
    "receivedKBytesPerSec" : 1.7633758265513735,
    "sentKBytesPerSec" : 1.2832077611054595
  },
  "GET Public Vacancies" : {
    "transaction" : "GET Public Vacancies",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 5.155000000000004,
    "medianResTime" : 5.0,
    "minResTime" : 3.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 23.90000000000009,
    "throughput" : 8.484642796538267,
    "receivedKBytesPerSec" : 2.3697342185643984,
    "sentKBytesPerSec" : 1.3174396529781096
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 400,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4.9200000000000035,
    "medianResTime" : 4.0,
    "minResTime" : 2.0,
    "maxResTime" : 31.0,
    "pct1ResTime" : 7.0,
    "pct2ResTime" : 8.0,
    "pct3ResTime" : 13.970000000000027,
    "throughput" : 16.77359835618736,
    "receivedKBytesPerSec" : 4.086926552606197,
    "sentKBytesPerSec" : 2.5717333417201322
  }
}